CREATE DATABASE nosztalgiavillamosok
DEFAULT CHARACTER SET utf8
COLLATE utf8_hungarian_ci;

CREATE TABLE villamosok
(
    id int(11) PRIMARY KEY,
    palyaszam int(4),
    gyartasi_ev year,
    forgalmba year,
    telephely varchar(50),
    vihet_utast boolean
);

INSERT INTO villamosok
(id, palyaszam, gyartasi_ev, forgalmba, telephely, vihet_utast) 
VALUES 
("1","436","1913","1987","Ferencváros","1"),
("2","611","1908","1987","Ferencváros","1"),
("3","616","1919","2017","Angyalföld","0"),
("4","1074","1912","1992","Budafok","0"),
("5","1233","1964","2018","Baross","1"),
("6","1305","1967","2013","Angyalföld","0"),
("7","1468","1978","2017","Ferencváros","0"),
("8","1469","1978","2017","Feremcváros","0"),
("9","1522","1940","2022","Ferencváros","1"),
("10","1820","1907","2018","Baross","0"),
("11","2624","1906","2012","Ferencváros","1"),
("12","2806","1911","2012","Baross","1"),
("13","3430","1960","2017","Zugló","0"),
("14","3720","1961","2018","Baross","1"),
("15","3873","1964","2007","Zugló","0"),
("16","3885","1964","2007","Zugló","0"),
("17","3888","1964","2007","Zugló","0"),
("18","3898","1964","2007","Zugló","0"),
("19","4000","1978","2026","Baross","1"),
("20","4171","1980","2026","Baross","1"),
("21","4200","1984","2026","Baross","1"),
("22","4349","1984","2026","Baross","1"),
("23","5005","1912","2020","Baross","1"),
("24","5600","1930","2012","Zugló","0"),
("25","5800","1939","2012","Zugló","0"),
("26","5869","1951","2007","Zugló","1"),
("27","5884","1949","2012","Baross","1"),
("28","5965","1951","1980","Zugló","0"),
("29","6010","1954","2007","Zugló","1"),
("30","7650","1942","1978","Zugló","1");

SELECT * FROM villamosok;